app/views/topics/show.html.erb

    <div id="postlist" class="mainbox viewthread">
      <% @topic.posts.each do |post| %>
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.topic_id = 3)

                <dt><%=t 'user.id' %></dt><dd><%= post.user.id %></dd>
                <dt><%=t 'user.post' %></dt><dd><%= post.user.posts.count %></dd>
                <dt><%=t 'user.topic' %></dt><dd><%= post.user.topics.count %></dd>
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `topics`.* FROM `topics` WHERE (`topics`.`id` = 2) LIMIT 1