app/views/boards/index.html.erb

SELECT COUNT(*) FROM `posts` WHERE (created_at > '2011-03-25' & created_at <'2011-03-26' )
---
<p class="right boardcount">
<%=t 'datetime.today' %>: <em><%= Post.today.count %> </em>,
<%=t 'datetime.yesterday' %>: <em><%= Post.yesterday.count %></em>

SELECT COUNT(*) FROM `posts` INNER JOIN `topics` ON `posts`.topic_id = `topics`.id WHERE ((`topics`.category_id = 1))
SELECT COUNT(*) FROM `topics` WHERE (`topics`.catogary_id = 1)
SELECT `posts`.* FROM `posts` INNER JOIN `topics` ON `posts`.topic_id = `topics`.id WHERE ((`topics`.category_id = 1)) ORDER BY posts.id DESC LIMIT 1
SELECT `topics`.* FROM `topics` WHERE (`topics`.category_id = 1) ORDER BY topics.id DESC LIMIT 1
---
		<td class="boardnums">
		<em><%= board.topics.size %></em> / <%= board.posts.size %></td>

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 0) LIMIT 1
---
			<p><%= board.topics.last %></p>
			<cite><%= board.posts.last.user %> - <span title="<%= board.posts.last.updated_at %>"><%=l board.posts.last.updated_at, :format => :short %></span></cite>