app/views/boards/show.html.erb

SELECT COUNT(*) FROM `posts` INNER JOIN `topics` ON `posts`.topic_id = `topics`.id WHERE ((`topics`.category_id = 1))
SELECT COUNT(*) FROM `topics` WHERE (`topics`.category_id = 1)
SELECT `posts`.* FROM `posts` WHERE (`posts`.topic_id = 2) ORDER BY posts.id DESC LIMIT 1
---
<h1 style=""><% @board.name %></h1>
<p class="boardstats">[ <strong><%= @board.topics.size %></strong> 主题 / <%= @board.posts.size %> 帖子]</p>

SELECT `topics`.* FROM `topics` WHERE (`topics`.category_id = 1) ORDER BY displayorder, id LIMIT 20 OFFSET 0
---
<div class="pages_btns s_clear">
<%= render 'layouts/pages', :count => @board.topics.count %>