app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def load_user
    if session[:user_id]
      @current_user = User.find_by_id session[:user_id]