app/controllers/boards_controller.rb

  def index
    @boards = Board.all#[Board.find(1)]#_all_by_id 1
---
SELECT `boards`.* FROM `boards` WHERE (`boards`.`id` = 1) LIMIT 1

  def show
    @page = params[:page] && !params[:page].empty? ? params[:page].to_i : 1
    @board = Board.find(params[:id])
    @actions = [@board]
    @topics = @board.topics.all(:offset => 20*@page-20, :limit => 20, :order => [:displayorder, :id])
---
SELECT `boards`.* FROM `boards` WHERE (`boards`.`id` = 1) LIMIT 1
SELECT COUNT(*) FROM `topics` WHERE (`topics`.category_id = 1)
SELECT `topics`.* FROM `topics` WHERE (`topics`.category_id = 1) ORDER BY displayorder, id LIMIT 20 OFFSET 0