app/controllers/moderations_controller.rb

SELECT `moderations`.* FROM `moderations` WHERE (`moderations`.`id` = 1) LIMIT 1
---
  def show
    @moderation = Moderation.find(params[:id])

INSERT INTO `moderations` (`user_id`, `association_id`, `association_type`, `action`, `note`, `created_at`, `updated_at`) VALUES (1, 2, 'topic', 'lock', NULL, '2010-12-26 13:28:15', '2010-12-26 13:28:15')
---
  def create
    @moderation = Moderation.new(params[:moderation])
    @moderation.user = @current_user
    case params[:moderation][:assocation_type]
    when "topic"
      #@moderation.association_ = Topic.find params[:moderation][:assocation_id]
      case params[:moderation][:action]
      when "lock"
        @moderation.association.locked = true
      end
    when "post"
      @moderation.association = Post.find params[:moderation][:topic_id]
    when "user"
      @moderation.association = Post.find params[:moderation][:user_id]
    end
    respond_to do |format|
      if @moderation.save && @moderation.association.save