app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.topic = Topic.find params[:post][:topic_id]
    if !@topic or @topic.locked
      respond_to do |format|
        format.html{ redirect_to(@post.topic, :notice => 'Can\'t Reply.') }
        format.xml{ render :xml => @post, :status => :unprocessable_entity}
      end
      return
    end

    @post.user = @correct_user
    @post.displayorder = @post.topic.floor
    respond_to do |format|
      if @post.save
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.topic_id = 2) ORDER BY displayorder DESC LIMIT 1
SELECT `topics`.* FROM `topics` WHERE (`topics`.`id` = 2) LIMIT 1
INSERT INTO `posts` (`topic_id`, `user_id`, `content`, `displayorder`, `readperm`, `private`, `anonymous`, `ubb`, `html`, `created_at`, `updated_at`) VALUES (2, 1, '喵。。', 2, NULL, NULL, NULL, NULL, NULL, '2010-12-26 08:40:26', '2010-12-26 08:40:26')