app/controllers/topics_controller.rb

  def show
    @page = params[:page] && !params[:page].empty? ? params[:page].to_i : 1
    @topic = Topic.find(params[:id])
    @actions = [@topic.category, @topic]
    @posts = Post.find_all_by_topic_id(params[:id], :offset => 10*@page-10, :limit => 10, :order => :displayorder)
---
SELECT `topics`.* FROM `topics` WHERE (`topics`.`id` = 2) LIMIT 1
SELECT `posts`.* FROM `posts` WHERE (`posts`.`topic_id` = 2) ORDER BY displayorder LIMIT 10 OFFSET 0

  def create
	#TODO: 验证category_id有效性
    @topic = Topic.new(params[:topic])
    #@topic.category_id = Board.find(params[:topic][:category_id])
    @topic.user = @correct_user
    @topic.displayorder = 0

    @post = Post.new(params[:post])
    @post.displayorder = 1
    @post.topic = @topic
    @post.user = @correct_user

    respond_to do |format|
      if @topic.save && @post.save
---
INSERT INTO `posts` (`topic_id`, `user_id`, `content`, `displayorder`, `readperm`, `private`, `anonymous`, `ubb`, `html`, `created_at`, `updated_at`) VALUES (2, NULL, '内容', 1, NULL, NULL, NULL, NULL, NULL, '2010-12-26 08:20:27', '2010-12-26 08:20:27')
INSERT INTO `topics` (`user_id`, `type_id`, `category_id`, `category_type`, `name`, `displayorder`, `views`, `readperm`, `locked`, `deleted`, `reverse`, `private`, `created_at`, `updated_at`) VALUES (1, NULL, 1, 'board', '继续测试', 0, NULL, NULL, NULL, NULL, NULL, NULL, '2011-03-24 12:40:27', '2011-03-24 12:40:27')

  def control
    if params['id']
      id = params['id'].split(/,/)
      return if id.empty?
    else
      return
    end
    data_control = {}
    Data_Control.each do |key| #喵你妹的Hash不带交集运算
      data_control[key] = params[key] if params[key]
    end
    unless data_control.empty?
      @topics_size = Topic.update_all(data_control, {:id => id})
---
UPDATE `topics` SET `highlight` = '16711680' WHERE (`topics`.`id` IN (2))